# VertexStreamPositionNormal Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexStreamPositionNormal Methods
VertexStreamPositionNormal Class See Also
---
The VertexStreamPositionNormal type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddVertex | Inserts a VertexStreamPositionNormal into the stream and associated buffer. |
| AddVertices | Inserts multiple VertexStreamPositionNormal instances into the stream and associated buffer. |
| Dispose | (Inherited from VertexStream.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace